In [1]:
import pandas as pd 
import numpy as np

In [2]:
d = {'A':[20,np.nan,31],'B':[np.nan,np.nan,42],'C':[np.nan,97,42]}

In [3]:
df = pd.DataFrame(d)
df

      A     B     C
0  20.0   NaN   NaN
1   NaN   NaN  97.0
2  31.0  42.0  42.0

In [6]:
df.isnull()

       A      B      C
0  False   True   True
1   True   True  False
2  False  False  False

In [7]:
df.dropna()

      A     B     C
2  31.0  42.0  42.0

In [12]:
df.dropna(thresh=2,axis=1) #drops B having atleast 2 nan values ... thresh =2

      A     C
0  20.0   NaN
1   NaN  97.0
2  31.0  42.0

In [13]:
df

      A     B     C
0  20.0   NaN   NaN
1   NaN   NaN  97.0
2  31.0  42.0  42.0

In [15]:
df['A'].fillna(value = df['A'].mean(),inplace =True) #fills columnn A values with mean of col A

In [16]:
df

      A     B     C
0  20.0   NaN   NaN
1  25.5   NaN  97.0
2  31.0  42.0  42.0

In [17]:
df.loc[1].fillna(value = df.loc[1].mean(), inplace = True) #fills row 1 with mean value

In [18]:
df

      A      B     C
0  20.0    NaN   NaN
1  25.5  61.25  97.0
2  31.0  42.00  42.0